Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/svd/PIC32CK2051SG01100.svd
            <register>
               <name>CON</name>
               <description>SPI Control register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXRXCOUNT</name>
                     <description>This bit specifies the total number of bytes to transmit or receive (based on CMD_INIT field). ,16?d 0 - Reserved,16?d 1 - 1byte to transmit/receive ,16?d 2 - 2bytes to transmit/receive NOTE: Count must be programmed to non-zero value prior to initiating transaction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CMDINIT</name>
                     <description>This signal indicates the command initiation mode. If it is Transmit, Commands are initiated based on writes to transmit register or the contents of TX FIFO. If the CMD_INIT is Receive, commands are initiated based on reads to Read register or RX FIFO availability. 00 = Reserved.  01 = Initiate Transmit.  10 = Initiate Receive. 11 = Reserved.  Note: If Boot mode is enabled, the default value  is 2?b10  This is NOT active status field, see SPI Status2 Reg (0x30)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LANEMODE</name>
                     <description>SPI Lane mode 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DEVSEL</name>
                     <description>SPI Device Select: This field along with bit25 is used to select a particular SPI device. Note: For Michigan Ax versions, extension by bit25 is NOT used (only 4 devices are selectable, by bits 21:20 here).</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DASSERT</name>
                     <description>Chip Select Assert 0 - CS is not de-asserted after transmission/reception of specified number of bytes in the control register 1 - CS is de-asserted after transmission/reception of specified number of bytes in the control register</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRMODE</name>
                     <description>SDR_DDR: 0 - SDR mode, 1 - DDR mode. Note: For Michigan Ax versions this bit is Reserved and should be kept 0.</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHECK</name>
                     <description>Status Check This bit is mainly used for Programming or Erase operations. 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: For Michigan Ax versions, this bit is Reserved and should be kept 0.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEV_SEL_2</name>
                     <description>SPI Device Select[2]: This field along with SPI DEVICE SELECT [1:0] (bits 21:20) together is used to select a particular SPI device. Bit25 Bit21 Bit20  0 0 0 - SPI Device 0 ,0 0 1 - SPI Device 1 ,0 1 0 - SPI Device 2  ,0 1 1 - SPI Device 3, 1 0 0 - SPI Device 4 ,1 0 1 - SPI Device 5 ,1 1 0 - SPI Device 6 ,1 1 1 - SPI Device 7 Note: For Michigan Ax versions, this bit is Reserved and should be kept 0.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKCON</name>
               <description>SPI Clock Control register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>This bit is set to 0 when the SPI Driver is not using the SPI Controller. The SPI  Controller should stop its internal clock to go very low power state. Still, registers  will be able to be read and written. Clock starts to oscillate when this bit is set to 1. When clock oscillation is stable, the SPI Controller will set Internal Clock Stable in this register to 1. 1 - Enable 0 - Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STABLE</name>
                     <description>After Reset, this bit is set to 1 when SPI Clock  is  stable  after  writing  Internal Clock  Enable  in  this  register  to  1. The Clock  Stable  indication  will  continue unless   the   Clock   Divisor   Value   is changed, in which case it will wait until Clock is stable again. Stability is reached when the Clock Divisor period has been reached. The SPI Host Driver should wait until this bit is set to 1 (and the Enable is 1) before programming the SPI Control register. 1 - Stable 0 - Not stable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>SPI Clock Frequency Select 400h - base clock divided by 2048 ,200h - base clock divided by 1024  ,100h - base clock divided by 512 ,080h - base clock divided by 256 ,040h - base clock divided by 128 ,020h - base clock divided by 64 ,010h - base clock divided by 32 ,008h - base clock divided by 16 ,004h - base clock divided by 8 ,002h - base clock divided by 4 ,001h - base clock divided by 2 ,000h - base clock Setting 000h specifies the highest frequency of the SPI Clock. NOTE:  When  DDR  mode  is  active,  the output SPI_CLK is further divided by two (so that internal clocking remains rise edge active internally)  Max output SPI_CLK for DDR is 66Mhz.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMDTHR</name>
               <description>SPI command threshold register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <resetValue>0x00000101</resetValue>
               <fields>
                  <field>
                     <name>RXCMDTHR</name>
                     <description>In RX initiation mode, SPI attempts to perform receive fetch operations until RX_CMD_THRES bytes of space remain in the receive buffer. If space for RX_CMD_THRES bytes is not present in the FIFO, then SPI would not initiate any transfer. RX_CMD_THRES should only be programmed when RX is not active, during IDLE or TX. Please note that if S/W performs any reads, thereby reducing the FIFO count, then HW would initiate RX transfer to get back FIFO count equal to RX_CMD_THRES. If S/W would not like any more words latched into FIFO, then command initiation mode needs to be changed to IDLE before any FIFO reads by S/W. In case of Boot/XIP mode, the SPI Controller uses the AHB Burst size, instead of RX CMD Threshold value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXCMDTHR</name>
                     <description>In TX Initiation Mode, SPI Performs a transmit Operation when TX_CMD_THRES bytes are present in the TX FIFO. This should usually be set to 1 for normal flash commands, and is desired to be set to a higher value for page programming. NOTE: Value of 8?d0 should be treated as Reserved (illegal) for this field. May produce unexpected activity on SPI bus. Furthermore, values should generally be limited to EVEN values (excepting a value  of 1), and MUST be so limited in DMA mode.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTTHR</name>
               <description>SPI Interrupt Threshold register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXINTTHR</name>
                     <description>Receive Interrupt is set when Receive FIFO CNT is larger than or equal to RX_INT_THRES Value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXINTTHR</name>
                     <description>Transmit Interrupt is set when Transmit FIFO has equal or more space than TX_INT_THRES bytes.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTEN</name>
               <description>SPI Interrupt Enable Register</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <resetValue>0x000000AD</resetValue>
               <fields>
                  <field>
                     <name>TXEMPTYIE</name>
                     <description>TX FIFO Empty Interrupt Enable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFULLIE</name>
                     <description>TX FIFO Full Interrupt Enable.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTHRIE</name>
                     <description>Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEMPTYIE</name>
                     <description>RX FIFO Empty Interrupt Enable.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFULLIE</name>
                     <description>RX FIFO Full Interrupt Enable.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTHRIE</name>
                     <description>Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power  on reset, till a read request on the AHB Bus.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONFULLIE</name>
                     <description>Control Buffer Full Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONEMPTYIE</name>
                     <description>Control Buffer Empty Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONTHRIE</name>
                     <description>Control Buffer Threshold Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDDONEIE</name>
                     <description>Current Buffer Descriptor Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKTCOMPIE</name>
                     <description>Packet completion Interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAEIE</name>
                     <description>Master Error Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTAT</name>
               <description>SPI Interrupt Status Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <resetValue>0x000000AD</resetValue>
               <fields>
                  <field>
                     <name>TXEMPTYIF</name>
                     <description>TX FIFO Empty Interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFULLIF</name>
                     <description>TX FIFO Full Interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTHRIF</name>
                     <description>Interrupt to be generated when the TX FIFO has space equal to or more than  TX_INT_THRES words.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEMPTYIF</name>
                     <description>RX FIFO Empty Interrupt.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFULLIF</name>
                     <description>RX FIFO Full Interrupt.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTHRIF</name>
                     <description>Interrupt to be generated when the RX FIFO has data more than or equal to  RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONFULLIF</name>
                     <description>Control Buffer Full Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONEMPTYIF</name>
                     <description>Control Buffer Empty Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONTHRIF</name>
                     <description>Control Buffer Threshold Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDDONEIF</name>
                     <description>BDP sets this bit to '1' after current buffer descriptor is processed</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKTCOMPIF</name>
                     <description>Packet completion Interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAEIF</name>
                     <description>Master Error Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXDATA</name>
               <description>SPI Transmit Data Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Data is loaded into this register before being transmitted. Just prior to the beginning of a data transfer, the data in TX_DATA is loaded into the shift register. This register is  used as a window to write data into Transmit buffer.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXDATA</name>
               <description>SPI Receive Data Register</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>At the end of a data transfer, the data in the shift register is loaded into RX_DATA register. This register is used as a window to read data from Receive buffer.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT1</name>
               <description>SPI Status1 Register</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x01000000</resetValue>
               <fields>
                  <field>
                     <name>RXBUFCNT</name>
                     <description>Number of Words of Read Data in the FIFO.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFFREE</name>
                     <description>Number of Words of Space available in the TX FIFO. Max value equals value of MEM_SIZE_BYTES parameter. Default value is Max</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
